# Toposolid Excavate By Method

Source: https://www.revitapidocs.com/2026/00ff5e57-e904-3779-31d2-25f3ea4ea64b.htm

---

| Toposolid Excavate By Method |
| --- |

Excavates the Toposolid by a given element.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void ExcavateBy(
	ElementId elementId
)
```

```
Public Sub ExcavateBy (
	elementId As ElementId
)
```

```
public:
void ExcavateBy(
	ElementId^ elementId
)
```

```
member ExcavateBy :
        elementId : ElementId -> unit
```

#### Parameters

elementId ElementId
:   Id of the element used to excavate the Toposolid.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The element is not supported for Toposolid excavation operations. |

See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace